{
  "id": "cpp",
  "name": "C++",
  "logo": "cpp_lang.png",
  "description": "C++ is a high-level, general-purpose programming language created as an extension of the C language by Bjarne Stroustrup in the early 1980s. It incorporates object-oriented, procedural, and generic programming features, making it extremely versatile and powerful. C++ has been widely used for developing operating systems, game engines, real-time simulations, high-performance applications, and large-scale enterprise software. Its combination of low-level memory control and high-level abstractions allows developers to write both efficient system-level code and complex application logic. The language provides features such as classes, inheritance, polymorphism, templates, exception handling, and the Standard Template Library (STL), which includes containers, algorithms, and iterators. Over the decades, C++ has influenced many modern languages including C#, Java, and Rust, and remains a cornerstone of software development in areas requiring performance and reliability. The language continues to evolve through ISO standardization, ensuring modern features while maintaining backward compatibility. C++’s rich ecosystem includes compilers, IDEs, libraries, and tools that support development across multiple platforms, from embedded systems to large-scale enterprise applications.",
  "story": "C++ was created by Bjarne Stroustrup at Bell Labs in the early 1980s as an enhancement to the C programming language, aiming to combine the efficiency of C with higher-level abstractions to support large-scale software development. Initially called 'C with Classes', it introduced features such as classes, inheritance, and strong type checking while maintaining compatibility with existing C code. Over the years, C++ evolved into a mature language with multiple paradigms, including procedural, object-oriented, and generic programming, enabling developers to tackle a wide variety of problems. The Standard Template Library (STL), added in the 1990s, brought standardized containers, algorithms, and iterators, simplifying common programming tasks and promoting code reuse. C++ has been fundamental in building critical systems, including operating systems, real-time simulations, graphical engines, compilers, and databases. Its performance and flexibility have made it the language of choice for applications where efficiency is paramount, such as video games, financial software, and embedded systems. The language has been continuously updated through ISO standards (C++98, C++03, C++11, C++14, C++17, C++20, and upcoming C++23), adding features like auto typing, smart pointers, concurrency support, lambda expressions, modules, and enhanced template programming. Bjarne Stroustrup’s vision emphasized both power and maintainability, making C++ suitable for both system-level programming and complex application development. The C++ community is large and active, organizing conferences, maintaining open-source libraries, and contributing to the language’s evolution. C++’s influence on modern computing is profound; many programming languages, frameworks, and software engineering practices have drawn inspiration from its design principles. Its combination of performance, flexibility, and expressive power ensures that C++ remains a critical language for software developers worldwide, continuing to shape the future of computing.",
  "official_docs": "https://en.cppreference.com/w/",
  "github": "https://github.com/isocpp/CppCoreGuidelines",
  "founders": [
    {
      "name": "Bjarne Stroustrup",
      "image": "https://hackaday.com/wp-content/uploads/2025/02/b-s-1.jpg?w=800",
      "twitter": "",
      "linkedin": "https://www.linkedin.com/in/bjarne-stroustrup-0b6b3313/",
      "github": ""
    }
  ],
  "use_cases": [
    {
      "company": "Adobe",
      "purpose": "Desktop applications like Photoshop and Illustrator."
    },
    {
      "company": "Microsoft",
      "purpose": "Windows OS components, Office suite, and high-performance apps."
    },
    {
      "company": "Google",
      "purpose": "High-performance backend systems and Chrome browser."
    },
    {
      "company": "Epic Games",
      "purpose": "Game engine development (Unreal Engine) and game development."
    }
  ]
}
