{
  "id": "php",
  "name": "PHP",
  "logo": "php_lang.png",
  "description": "PHP (PHP: Hypertext Preprocessor, a recursive acronym) is a widely-used, open-source, general-purpose scripting language that is especially well-suited for server-side web development and can be embedded directly into HTML. Created by Rasmus Lerdorf in 1994 and first released in 1995, PHP has grown to become one of the most popular server-side programming languages, powering a significant portion of the internet including some of the world's largest websites and web applications. PHP is executed on the server side, processing code and generating dynamic HTML content that is then sent to the client's web browser, making it ideal for creating dynamic, interactive, and data-driven websites. The language is known for its ease of use, gentle learning curve, extensive documentation, and massive ecosystem of frameworks, libraries, and tools that accelerate development. PHP features a syntax influenced by C, Java, and Perl, making it familiar to developers with experience in those languages. It supports multiple programming paradigms including procedural, object-oriented, and functional programming styles, giving developers flexibility in how they structure their code. PHP offers automatic memory management through reference counting and garbage collection, extensive built-in support for interacting with databases (MySQL, PostgreSQL, SQLite, and many others), file systems, sessions, cookies, and virtually every web-related task. The language includes a rich standard library with thousands of built-in functions for string manipulation, array operations, date and time handling, cryptography, image processing, XML parsing, and much more. PHP powers popular content management systems like WordPress (which runs over 40% of all websites), Drupal, and Joomla, e-commerce platforms like Magento and WooCommerce, and frameworks like Laravel, Symfony, and CodeIgniter that provide structure and tools for building modern web applications. The language runs on virtually every operating system and web server, making it highly portable and accessible. PHP's integration with HTML is seamless, allowing developers to mix PHP code directly within HTML markup, though modern best practices encourage separation of concerns. The language has evolved significantly over its lifetime, with major versions introducing substantial improvements in performance, security, and features. PHP 7, released in 2015, brought dramatic performance improvements (often 2-3x faster than PHP 5), reduced memory consumption, and new language features. PHP 8, released in 2020, introduced JIT (Just-In-Time) compilation for even better performance, union types, named arguments, attributes, and many other modern language features. Despite facing criticism over the years for inconsistencies in its standard library and some design decisions from its early days, PHP has continuously evolved and modernized, addressing many historical concerns while maintaining backward compatibility. The language has a massive, active community, extensive learning resources, and countless hosting providers offering PHP support out of the box, making it one of the most accessible languages for web development.",
  "story": "PHP was created by Rasmus Lerdorf, a Danish-Canadian programmer, in 1994 as a set of Common Gateway Interface (CGI) binaries written in C to track visits to his online resume and personal homepage. Originally called 'Personal Home Page Tools' (PHP Tools), it was a simple set of scripts for basic web page functionality. Lerdorf released the source code publicly in 1995, allowing other developers to use and modify it, which led to community contributions and improvements. The early version, known as PHP/FI (Personal Home Page / Forms Interpreter), was released in 1997 and included basic functionality for building dynamic web pages and processing form data. However, PHP/FI was limited in scope and not designed as a full programming language. The turning point came in 1998 when two Israeli developers, Andi Gutmans and Zeev Suraski, rewrote the PHP parser from scratch, creating PHP 3. This version transformed PHP from a simple tool into a serious programming language with support for multiple databases, extensibility through modules, and a more consistent syntax. PHP 3 was released in June 1998 and marked the beginning of PHP's rapid growth in popularity. Gutmans and Suraski continued their work, developing the Zend Engine, a new scripting engine that would power PHP 4, released in May 2000. The Zend Engine significantly improved performance, added support for more advanced programming features, and established PHP as a professional-grade language for web development. The name 'Zend' came from combining their first names (Zeev and Andi). PHP 4 saw massive adoption, becoming the dominant server-side language for web development during the early 2000s. PHP 5, released in July 2004, was another major milestone, introducing a completely rewritten object-oriented programming model with classes, interfaces, abstract classes, and other OOP features that brought PHP in line with languages like Java and C#. This version also introduced the PHP Data Objects (PDO) extension for database access, improved XML support, and better error handling through exceptions. PHP 5 remained the primary version for over a decade, with incremental updates adding features like namespaces, late static binding, closures, and traits. The development of PHP 6 was attempted but ultimately abandoned due to challenges with Unicode implementation. Instead, the community moved forward with PHP 7, which was released in December 2015 and represented a massive leap forward. PHP 7 was built on a new version of the Zend Engine (PHPNG - PHP Next Generation) that dramatically improved performance, often making applications 2-3 times faster while using less memory. This performance improvement was crucial for PHP's continued relevance in an era of increasing competition from Node.js and other technologies. PHP 7 also introduced scalar type declarations, return type declarations, the null coalescing operator, and other modern language features. The version number jumped from 5 to 7 to avoid confusion with the abandoned PHP 6. PHP 7.x continued to evolve with several minor releases adding features like nullable types, void return types, and improved error handling. PHP 8.0, released in November 2020, brought another major evolution with JIT compilation, union types, named arguments, attributes (similar to annotations in other languages), match expressions, constructor property promotion, and many other improvements. PHP 8.1 and subsequent versions have continued adding features like enums, readonly properties, and fibers for improved async programming. Throughout its history, PHP has powered some of the internet's most significant platforms. Facebook was originally built entirely in PHP, and while they've since created Hack (a PHP dialect) and HHVM (an alternative runtime), PHP remains at the core of their infrastructure. WordPress, the world's most popular content management system, is written in PHP and powers over 40% of all websites on the internet. Wikipedia, Slack, Etsy, MailChimp, and countless other major platforms rely on PHP. The language has faced criticism over the years for inconsistencies in its standard library (function naming conventions, parameter orders), weak typing leading to unexpected behavior, and security issues in poorly written code. However, the PHP community has worked diligently to address these concerns, with modern PHP being a much more consistent, secure, and performant language. The PHP-FIG (PHP Framework Interop Group) has established PSR (PHP Standards Recommendations) that provide coding standards and interoperability guidelines, improving consistency across the ecosystem. Modern PHP frameworks like Laravel have brought elegant syntax, powerful features, and best practices to PHP development, making it competitive with frameworks in other languages. Composer, PHP's dependency manager introduced in 2012, revolutionized how PHP developers manage libraries and dependencies. Today, PHP continues to be actively developed with regular releases, a strong commitment to backward compatibility, and a focus on performance and modern language features. While newer languages and technologies have emerged, PHP's massive installed base, mature ecosystem, ease of deployment, and continuous evolution ensure it remains a vital part of the web development landscape.",
  "official_docs": "https://www.php.net/docs.php",
  "github": "https://github.com/php/php-src",
  "founders": [
    {
      "name": "Rasmus Lerdorf",
      "image": "https://webmull.com/wp-content/uploads/2016/05/Rasmus-Lerdorf-PHP.jpg",
      "twitter": "https://twitter.com/rasmus",
      "linkedin": "https://www.linkedin.com/in/rasmuslerdorf/",
      "github": "https://github.com/rlerdorf"
    }
  ],
  "use_cases": [
    {
      "company": "Facebook (Meta)",
      "purpose": "Backend services and web applications (originally built with PHP)."
    },
    {
      "company": "WordPress",
      "purpose": "Content management system powering 40% of websites."
    },
    {
      "company": "Slack",
      "purpose": "Backend API services and web applications."
    },
    {
      "company": "Etsy",
      "purpose": "E-commerce platform and marketplace backend."
    }
  ]
}