{
  "id": "ruby",
  "name": "Ruby",
  "logo": "ruby_lang.png",
  "description": "Ruby is a dynamic, open-source, object-oriented programming language with a strong focus on simplicity, productivity, and developer happiness. Created by Yukihiro 'Matz' Matsumoto in Japan in the mid-1990s, Ruby was designed with the explicit philosophy that programming should be enjoyable and that the language should prioritize human needs over computer needs. Ruby emphasizes elegant, natural, and human-friendly syntax that reads almost like English, making code easy to write, read, and understand. It's a pure object-oriented language where absolutely everything is an object, including primitive types like numbers and booleans, providing remarkable consistency in how you interact with different data types. Ruby supports multiple programming paradigms including procedural, object-oriented, and functional programming, giving developers flexibility in how they approach problems. The language is best known for Ruby on Rails, the revolutionary web application framework that transformed web development in the mid-2000s with its convention-over-configuration philosophy, emphasis on developer productivity, and elegant approach to building database-backed web applications. Ruby features automatic memory management through garbage collection, dynamic typing that allows for flexible and expressive code, powerful metaprogramming capabilities that enable developers to write code that writes code, blocks and closures as first-class language features, mixins through modules for sharing behavior across classes without traditional inheritance, and an elegant syntax for everything from string interpolation to regular expressions. The language includes a comprehensive standard library covering file I/O, networking, data structures, and much more, plus a rich ecosystem of gems (Ruby's term for libraries and packages) distributed through RubyGems, the package manager that makes it trivial to share and use code. Ruby's syntax is remarkably clean and expressive, often allowing developers to accomplish in a few lines what might take many more in other languages, without sacrificing readability. The language emphasizes the principle of least surprise, meaning it should behave in a way that minimizes confusion for experienced users, though this is balanced with Matz's philosophy that the language should be optimized for programmer happiness. Ruby has powerful features like duck typing (if it walks like a duck and quacks like a duck, it's a duck), open classes that allow you to modify existing classes including built-in ones, symbols for efficient string-like identifiers, and a flexible syntax that often makes parentheses and other punctuation optional. The language has excellent support for text processing, making it popular for scripting and automation tasks, and its expressiveness makes it a favorite for domain-specific languages (DSLs). Ruby's community is known for being friendly, welcoming, and focused on best practices, with a strong emphasis on testing, clean code, and continuous improvement. The language has influenced many other languages and frameworks, and its philosophy of developer happiness has shaped how many programmers think about language design and software development.",
  "story": "Ruby was created by Yukihiro Matsumoto, affectionately known as 'Matz' in the Ruby community, in Japan in the mid-1990s, with the first public release (version 0.95) on December 21, 1995. Matz began working on Ruby on February 24, 1993, motivated by his dissatisfaction with existing scripting languages and his desire to create a language that would make programming more enjoyable. He wanted to create a language that was more powerful and object-oriented than Perl, more elegant and consistent than Python, and more fun to use than any existing language. Matz drew inspiration from his favorite programming languages, combining features from Perl (text processing and regular expressions), Smalltalk (pure object-oriented design and message passing), Eiffel (design by contract concepts), Ada (exception handling), and Lisp (functional programming features and powerful metaprogramming). The name 'Ruby' was chosen as a gemstone name, following the tradition of Perl (which sounds like 'pearl'), and because it was the birthstone of one of Matz's colleagues. Ruby was also chosen because it comes after Perl in several contexts (ruby is more valuable than pearl, and Ruby comes after Perl alphabetically). For its first several years, Ruby remained relatively unknown outside of Japan, where it developed a dedicated following and was used for various applications. The language evolved through the late 1990s and early 2000s with incremental improvements, but remained largely a Japanese phenomenon with limited English documentation. The turning point for Ruby came in 2004-2005 with the emergence of Ruby on Rails, a web application framework created by David Heinemeier Hansson (DHH) while building Basecamp, a project management application. Rails was extracted from Basecamp and released as open-source software in July 2004, with version 1.0 arriving in December 2005. Ruby on Rails revolutionized web development with its convention-over-configuration approach, which eliminated much of the boilerplate code required in other frameworks, its emphasis on RESTful design, its integrated testing framework, its database migrations for managing schema changes, and its overall philosophy of developer happiness and productivity. Rails demonstrated that you could build sophisticated web applications rapidly without sacrificing code quality or maintainability. The framework's success was phenomenal, sparking what became known as the 'Rails revolution' and bringing Ruby into the international spotlight. Suddenly, developers around the world were learning Ruby specifically to use Rails, and the language's popularity exploded. This period saw the emergence of numerous Ruby conferences, user groups, books, tutorials, and a vibrant global community. The success of Rails also validated Ruby's design philosophy, showing that a language optimized for developer happiness could lead to remarkable productivity gains. Ruby's growth led to increased attention to performance and scalability. Ruby 1.8, which was the version when Rails emerged, was relatively slow compared to other languages. The community responded with several initiatives: JRuby (Ruby implemented on the Java Virtual Machine), Rubinius (Ruby implemented in Ruby itself with a custom VM), and most significantly, the development of Ruby 1.9, which included YARV (Yet Another Ruby VM), a new bytecode interpreter that significantly improved performance. Ruby 1.9, released in 2007 with a stable version in 2009, brought major improvements including better performance, improved Unicode support, new syntax features, and a more robust standard library. Ruby 2.0, released in 2013 on the language's 20th anniversary, continued this evolution with keyword arguments, refinements for safer monkey-patching, and other improvements. Subsequent versions (2.1, 2.2, 2.3, etc.) brought incremental performance improvements and new features. Ruby 3.0, released on Christmas Day 2020 (25 years after Ruby's initial release), was a major milestone with the goal of being 3x faster than Ruby 2.0, introducing a JIT compiler, improved concurrency with Ractor (Ruby's actor-model implementation), type signatures through RBS, and many other enhancements. Throughout its history, Ruby has powered numerous significant applications and companies. GitHub, the world's largest code hosting platform, was built with Ruby on Rails and remains largely Rails-based. Shopify, one of the largest e-commerce platforms, is built on Rails and has become one of the biggest contributors to Ruby and Rails development. Basecamp, the project management tool that spawned Rails, continues to be built with Rails. Airbnb, Twitch, Hulu, and countless other companies have used Ruby and Rails for their web applications. The Ruby community has been instrumental in advancing software development practices, particularly around testing (with tools like RSpec and Cucumber), continuous integration, and agile methodologies. The community has also been a leader in promoting diversity and inclusion in tech, with initiatives like RailsBridge providing free workshops to underrepresented groups. Matz has remained actively involved in Ruby's development, guided by his philosophy that 'Ruby is designed to make programmers happy' and the principle of least surprise. The language continues to evolve with annual releases, balancing innovation with stability and backward compatibility. While Ruby faced competition from newer languages like Node.js and Go, and some companies have moved away from Rails for various reasons, Ruby remains a vital and beloved language with a strong community, mature ecosystem, and continued relevance in web development, DevOps tooling, and automation. The language's influence extends far beyond its direct usage, having inspired features in other languages and shaped how many developers think about API design, developer experience, and the joy of programming.",
  "official_docs": "https://ruby-doc.org/",
  "github": "https://github.com/ruby/ruby",
  "founders": [
    {
      "name": "Yukihiro Matsumoto",
      "image": "https://www.computersciencedegreehub.com/wp-content/uploads/2014/10/yukihiro-matsumoto.jpg",
      "twitter": "https://twitter.com/yukihiro_matz",
      "linkedin": "",
      "github": "https://github.com/matz"
    }
  ],
  "use_cases": [
    {
      "company": "GitHub",
      "purpose": "Web application backend built with Ruby on Rails."
    },
    {
      "company": "Shopify",
      "purpose": "E-commerce platform and merchant tools."
    },
    {
      "company": "Basecamp",
      "purpose": "Project management and team collaboration tools."
    },
    {
      "company": "Airbnb",
      "purpose": "Backend services and web application development."
    }
  ]
}